In [1]:
import pandas as pd

In [2]:
q_df = pd.DataFrame([['male','teacher'],['male','engineer'],['female',None],['female','engineer']],columns = ['sex','profession'])
q_df

      sex profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [3]:
#缺失值填入字串'others'
q_df_others=q_df.fillna('others')
q_df_others

      sex profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [4]:
#以get_dummies()將資料表字串做one-hot encoding一般非順序性編碼
df = pd.get_dummies(q_df_others)
q_df = pd.concat([q_df_others,df],axis=1)
q_df

,sex,profession,sex_female,sex_male,profession_engineer,profession_others,profession_teacher
0,male,teacher,0,1,0,0,1
1,male,engineer,0,1,1,0,0
2,female,others,1,0,0,1,0
3,female,engineer,1,0,1,0,0